## Plan Result (1148: sbox_xhibit - TerraformPlanApply)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * databricks_external_location.landing_external
  * databricks_storage_credential.external
* Update
  * databricks_cluster.shared_autoscaling




<details><summary>Change Result (Click me)</summary>

```hcl

  # databricks_cluster.shared_autoscaling will be updated in-place
  ~ resource "databricks_cluster" "shared_autoscaling" {
      ~ custom_tags                    = {
          + "Data-Ingest-Project"   = "Crime Legacy Migration"
          + "application"           = "dlrm-data-ingest"
          + "builtFrom"             = "hmcts/dlrm-data-ingest-crime"
          + "businessArea"          = "cross-cutting"
          + "criticality"           = "Low"
          + "environment"           = "sandbox"
          + "expiresAfter"          = "3000-01-01"
          - "x_Data-Ingest-Project" = "Crime Legacy Migration" -> null
          - "x_application"         = "dlrm-data-ingest" -> null
          - "x_builtFrom"           = "hmcts/dlrm-data-ingest-crime" -> null
          - "x_businessArea"        = "cross-cutting" -> null
          - "x_criticality"         = "Low" -> null
          - "x_environment"         = "sandbox" -> null
          - "x_expiresAfter"        = "3000-01-01" -> null
        }
        id                             = "1027-115730-8wigejd"
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # databricks_external_location.landing_external will be created
  + resource "databricks_external_location" "landing_external" {
      + browse_only     = (known after apply)
      + comment         = "Managed by TF"
      + created_at      = (known after apply)
      + created_by      = (known after apply)
      + credential_id   = (known after apply)
      + credential_name = (known after apply)
      + id              = (known after apply)
      + isolation_mode  = (known after apply)
      + metastore_id    = (known after apply)
      + name            = "external_st"
      + owner           = (known after apply)
      + updated_at      = (known after apply)
      + updated_by      = (known after apply)
      + url             = "abfss://landing@ingest05landingsbox.dfs.core.windows.net"
    }

  # databricks_storage_credential.external will be created
  + resource "databricks_storage_credential" "external" {
      + comment               = "Managed by TF"
      + id                    = (known after apply)
      + isolation_mode        = (known after apply)
      + metastore_id          = (known after apply)
      + name                  = "crime_dbrics_catalogue"
      + owner                 = (known after apply)
      + storage_credential_id = (known after apply)

      + azure_managed_identity {
          + access_connector_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest05-product-databricks001-managed-rg/providers/Microsoft.Databricks/accessConnectors/unity-catalog-access-connector"
          + credential_id       = (known after apply)
        }

      + databricks_gcp_service_account (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 1148: sbox_xhibit - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"1148: sbox_xhibit - TerraformPlanApply","Vars":{}} -->